Revit 2024 API
BindingMap Class
The parameters BindingMap contains all the parameter bindings that exist in the Autodesk Revit project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class BindingMap : DefinitionBindingMap
Visual Basic
Public Class BindingMap _
	Inherits DefinitionBindingMap
Visual C++
public ref class BindingMap : public DefinitionBindingMap
Remarks
The ParameterBindingsMap is available from the Document.ParameterBindings property. A parameter binding is the way that a parameter definition is bound to elements within one or more categories. This map can be used to interrogate existing bindings, but it can also be used to generate new parameter bindings by using the Insert method.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.DefinitionBindingMap
 Autodesk.Revit.DB.BindingMap
See Also
BindingMap Members
Autodesk.Revit.DB Namespace